In [14]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
import matplotx

# Pandas Data Frame Basic

In [ ]:
df = pd.read_csv(r"E:\GitHub\Pandas\countries_data.csv")

# head is used for displaying the first 5 rows of the data

display("First five rows", df.head())

# tail is used for displaying the last 5 rows of the data

display("Last five rows",df.tail())

# info is used for displaying the information about the data

display("Information about the data",df.info)

# describe is used for displaying the statistical information about the data

display("Statistical information about the data",df.describe())

# type is used for displaying the type of the data

display("Type of the data",df.dtypes)

'First five rows'

            name            capital  population     area     region
0  South Georgia  King Edward Point          30   3903.0  Antarctic
1        Grenada       St. George's      112519    344.0   Americas
2    Switzerland               Bern     8654622  41284.0     Europe
3   Sierra Leone           Freetown     7976985  71740.0     Africa
4        Hungary           Budapest     9749763  93028.0     Europe

'Last five rows'

            name     capital  population      area    region
245      Belgium    Brussels    11555997   30528.0    Europe
246       Israel   Jerusalem     9216900   20770.0      Asia
247  New Zealand  Wellington     5084300  270467.0   Oceania
248    Nicaragua     Managua     6624554  130373.0  Americas
249     Anguilla  The Valley       13452      91.0  Americas

'Information about the data'

<bound method DataFrame.info of               name            capital  population      area     region
0    South Georgia  King Edward Point          30    3903.0  Antarctic
1          Grenada       St. George's      112519     344.0   Americas
2      Switzerland               Bern     8654622   41284.0     Europe
3     Sierra Leone           Freetown     7976985   71740.0     Africa
4          Hungary           Budapest     9749763   93028.0     Europe
..             ...                ...         ...       ...        ...
245        Belgium           Brussels    11555997   30528.0     Europe
246         Israel          Jerusalem     9216900   20770.0       Asia
247    New Zealand         Wellington     5084300  270467.0    Oceania
248      Nicaragua            Managua     6624554  130373.0   Americas
249       Anguilla         The Valley       13452      91.0   Americas

[250 rows x 5 columns]>

'Statistical information about the data'

         population          area
count  2.500000e+02  2.500000e+02
mean   3.111089e+07  6.005848e+05
std    1.296673e+08  1.909805e+06
min    0.000000e+00  4.400000e-01
25%    2.210995e+05  1.194250e+03
50%    4.912244e+06  6.492950e+04
75%    1.902577e+07  3.727260e+05
max    1.402112e+09  1.709824e+07

'Type of the data'

name           object
capital        object
population      int64
area          float64
region         object
dtype: object

In [16]:
# Shape is attribute not method
# use shape to get the number of rows and columns

display("Number of rows and columns",df.shape)

'Number of rows and columns'

(250, 5)

In [17]:
# Use columns to get the column names

display("Column names",df.columns)

# Select subset of columns

country = df['name']
display("Selecting subset of columns",country)

# Selecting multiple columns

multiple_columns = df[['name','area','population']]
display("Selecting multiple columns",multiple_columns)

'Column names'

Index(['name', 'capital', 'population', 'area', 'region'], dtype='object')

'Selecting subset of columns'

0      South Georgia
1            Grenada
2        Switzerland
3       Sierra Leone
4            Hungary
           ...
245          Belgium
246           Israel
247      New Zealand
248        Nicaragua
249         Anguilla
Name: name, Length: 250, dtype: object

'Selecting multiple columns'

              name      area  population
0    South Georgia    3903.0          30
1          Grenada     344.0      112519
2      Switzerland   41284.0     8654622
3     Sierra Leone   71740.0     7976985
4          Hungary   93028.0     9749763
..             ...       ...         ...
245        Belgium   30528.0    11555997
246         Israel   20770.0     9216900
247    New Zealand  270467.0     5084300
248      Nicaragua  130373.0     6624554
249       Anguilla      91.0       13452

[250 rows x 3 columns]

In [18]:
# Selecting single row

single_row = df.loc[0]
display("Selecting single row",single_row)

# Selecting multiple rows

multiple_rows = df.loc[[0,1,2]]
display("Selecting multiple rows",multiple_rows)

selecting_rows_and_columns = df.loc[[0,1,2],['name','area','population']]
display("Selecting multiple rows and columns",selecting_rows_and_columns)

# Selecting rows based on condition

selecting_rows_based_on_condition = df[df['area'] > 100000]

'Selecting single row'

name              South Georgia
capital       King Edward Point
population                   30
area                     3903.0
region                Antarctic
Name: 0, dtype: object

'Selecting multiple rows'

            name            capital  population     area     region
0  South Georgia  King Edward Point          30   3903.0  Antarctic
1        Grenada       St. George's      112519    344.0   Americas
2    Switzerland               Bern     8654622  41284.0     Europe

'Selecting multiple rows and columns'

            name     area  population
0  South Georgia   3903.0          30
1        Grenada    344.0      112519
2    Switzerland  41284.0     8654622

In [20]:
#Select rows using iloc

selecting_rows_using_iloc = df.iloc[0:3]
display(selecting_rows_using_iloc)

            name            capital  population     area     region
0  South Georgia  King Edward Point          30   3903.0  Antarctic
1        Grenada       St. George's      112519    344.0   Americas
2    Switzerland               Bern     8654622  41284.0     Europe

In [19]:
# Create a Series

s = pd.Series(["Earth", "Moon", "Mars", "Venus", "Jupiter", "Saturn", "Uranus", "Neptune", "Pluto"])
display(s)

0      Earth
1       Moon
2       Mars
3      Venus
4    Jupiter
5     Saturn
6     Uranus
7    Neptune
8      Pluto
dtype: object